Revit 2024 API
Mullion.Lock Property
Get - to get whether the Mullion line is locked. Set - Lock/unlock the Mullion.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool Lock { get; set; }
Visual Basic
Public Property Lock As Boolean
	Get
	Set
Visual C++
public:
property bool Lock {
	bool get ();
	void set (bool value);
}
See Also
Mullion Class
Autodesk.Revit.DB Namespace